This introduction to pandas is derived from Data School's pandas Q&A with my own notes and code.

# Reading a tabular data file into pandas

Tabular data file refers to tabular data refers to data that is organized in a table with rows and columns.
## tabular data examples:
    - csv
    - excel
    - table_like data format

In [1]:
# import pandas
import pandas as pd

In [2]:
# reading a well-formatted .tsv file
url = 'http://bit.ly/chiporders'
orders = pd.read_table(url)
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## read_table() method will copnsider
    - File is a tab-separated values (TSV) file
    - presence of a header row

In [3]:
url2 ='http://bit.ly/movieusers'
users = pd.read_table(url2)
users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

## Issues

* Separator is a pipe characfter ( | )
    1. We need to tell pandas that this is the separator using sep='|'
* The first row is not header names
    1. We need to  set header attribute to None ( header = None)
    2. We provide a list ofcolumn names to provde custome names of our choice ( names = user_cols)

In [4]:
user_cols =['user_id','age','gender','occupation','zip_code']
users =pd.read_table(url2, sep ='|', header = None, names = user_cols)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## Bonus Tips:

### Pandas: skip rows while reading file to a dataframe

#### Method 1: Skipping N rows from the starting while reading a csv file.
 df = pd.read_csv(" students.csv", skiprows = 2)

#### Method 2: Skip N rows from the end while reading a csv file. 
df = pd.read_csv("students.csv",
                  skipfooter = 5,
                  engine = 'python')

### References:

[Easy Data Analysis and Manipulation Using Pandas Library](https://medium.com/analytics-vidhya/easy-data-analysis-and-manipulation-using-pandas-library-ea588499d452)

[How to skip rows while reading csv file using Pandas?](https://www.geeksforgeeks.org/how-to-skip-rows-while-reading-csv-file-using-pandas/)

[pandas.read_table documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_table.html)